const langArr = {
  menu: {
    ru: "Главная",
    ua: "Головна",
  },
    menu2: {
      ru: "О нас",
      ua: "Про нас",
    },
    menu3: {
      ru: "Услуги",
      ua: "Послуги",
    },
    menu4: {
      ru: "Преподаватели",
      ua: "Викладачі",
    },
    menu5: {
      ru: "Отзывы",
      ua: "Відгуки",
    },
    menu6: {
      ru: "Расписание",
      ua: "Розклад",
    },
    menu7: {
      ru: "Контакты",
      ua: "Контакти",
    },
    menu8: {
      ru: "Информация",
      ua: "Інформація",
    },
    slide: {
      ru: "Для учеников 5 - 11 классов",
      ua: "Для учнів 5 - 11 класів",  
    },
    slide2: {
      ru: "Подготовка к ВНО",
      ua: "Підготовка до ЗНО",  
    },
    slide3: {
        ru: "Подготовка к ЕГЭ",
        ua: "Підготовка до ДПА",  
    },
    slide4: {
      ru: "Бесплатное первое занятие",
      ua: "Безкоштовне перше заняття",  
    },
    headerSubtitle1: {
      ru: "Math Corporation",
      ua: "Math Corporation",    
    },
    headerSubtitle2: {
      ru: "Репетиторские занятия по математике",
      ua: "Репетиторські заняття з математики",    
    },
    headerTitle: {
      ru: "Математика Алгебра Геометрия Физика",
      ua: "Математика Алгебра Геометрія Фізика",    
    },
    headerButton: {
      ru: "Запись на бесплатное занятие",
      ua: "Запис на безкоштовне заняття",    
    },
    aboutTitle: {
      ru: "О нас",
      ua: "Про нас",    
    },
    aboutText: {
      ru: "Math Corporation - то место, где вы найдете профессионального репетитора. Профессиональный репетитор в нашем понимании это тот, кто может найти общий язык с учеником, мотивировать его и вывести на нужный уровень знаний.",
      ua: "  Math Corporation – те місце де ви знайдете професійного репетитора. Професійний репетитор в нашому розумінні це той хто може знайти спільну мову з учнем, змотивувати його і вивести на потрібний рівень знань.",    
    },
    processTitle: {
      ru: "Процесс обучения",
      ua: "Процес навчання",    
    },
    processText: {
      ru: `Для того, чтобы вы лучше нас поняли, мы расскажем, как ученики записываются к нам на занятия и как они добиваются успеха.
      Сначала вы записываетесь на бесплатное вводное занятие позвонив нам или через сайт. На вводном занятии мы даем писать наш вступительный тест, который разработали репетиторы Math Corporation, тест очень насыщенный он содержит задачи по всем ключевым темам по математике (а в математике едва ли не каждая такая) начиная с 5 класса. Во время вступительного занятия преподаватель знакомится с учеником и помогает ему писать тестирования. После завершения тестирования мы проверяем его и рассказываем родителям о темах которые нужно повторить или переучить и как мы выстроим программу. Далее еще до начала первых занятий мы составляем индивидуальную программу для каждого ученика, которую делим на блоки, после каждого из которых мы пишем контрольную и коррекцию. И так мы движемся от блока к блоку пока достигаем нашу цель. Программу выстраиваем от простых к более сложным темам, что делает обучение комфортным. Занятия у нас проходят в мини группах по 4 ученика, каждый ученик занимается по индивидуальной программе есть ученики не связаны между собой, преподаватель помогает разобраться с материалом и постоянно проверяет выполненные задания.
      Основное время занятий мы всегда выделяем для того, чтобы проходить нашу программу, но если у ученика (цы) возникают вопросы по школе мы всегда рады помочь.`,
      ua: `Для того, щоб ви краще нас зрозуміли, ми розповімо, як учні записуються до нас на заняття і як вони досягають успіху.  
      Спочатку ви записуєтесь на безкоштовне вступне заняття зателефонувавши нам або через сайт. На вступному занятті ми даємо писати наш вступний тест, який розробили репетитори Math Corporation, тест дуже насичений він містить завдання по всім ключовим темам з математики(а в математиці ледь не кожна така)  починаючи з 5 го класу. Під час вступного заняття викладач знайомиться з учнем і допомагає йому писати тестування. Після завершення тестування ми перевіряємо його і розповідаємо батькам про теми які потрібно повторити або перевчити і як ми вибудуємо програму. Далі ще до початку перших занять ми складаємо індивідуальну програму для кожного учня, яку ділимо на блоки, після кожного з яких ми пишемо контрольну і корекцію. І так ми рухаємось від блоку до блоку поки досягаємо нашу ціль. Програму вибудовуємо від простіших до складніших тем, що робить навчання комфортним. Заняття у нас проходять в міні групах по 4 учня, кожен учень займається по індивідуальній програмі тобто учні не пов’язані між собою, викладач допомагає розібратись з матеріалом і постійно перевіряє виконані завдання.  
      Основний час занять ми завжди виділяємо для того, щоб проходити нашу програму, але якщо в учня(ці) виникають питання по школі ми завжди раді допомогти.`,    
    },
    servicesTitle: {
      ru: "Услуги и цены",
      ua: "Послуги та ціни",    
    },
    servicesAlgebra: {
      ru: "Алгебра",
      ua: "Алгебра",    
    },
    servicesGeometry: {
      ru: "Геометрия",
      ua: "Геометрія",    
    },
    servicesPhysics: {
      ru: "Физика",
      ua: "Фізика",    
    },
    servicesZno: {
      ru: "ВНО",
      ua: "ЗНО",    
    },
    servicesDpa: {
      ru: "ЕГЭ",
      ua: "ДПА",    
    },
    centerText: {
      ru: "Помни, что мы - не курсы, мы - репетиторский центр Math Corporation",
      ua: "Пам'ятай, що ми - не курси, ми - репетиторський центр Math Corporation",    
    },
    headerButton2: {
        ru: "Запись на бесплатное занятие",
        ua: "Запис на безкоштовне заняття",    
    },
    teamText: {
      ru: "У нас работают только опытные преподаватели с высшим образованием лучших вузов страны",
      ua: "У нас працюють лише досвідченні викладачі з вищою освітою кращих вишів країни",    
    },
    reviewsTitle: {
      ru: "Отзывы",
      ua: "Відгуки",    
    },
    scheduleTitle: {
      ru: "Расписание занятий",
      ua: "Розклад занять",    
    },
    scheduleItemTitle1: {
      ru: "С июня по сентябрь",
      ua: "З червня по вересень",    
    },
    scheduleItemTitle2: {
      ru: "С сентября по июнь",
      ua: "З вересня по червень",    
    },
    scheduleDay1: {
      ru: "Понедельник",
      ua: "Понеділок",    
    },
    scheduleDay11: {
      ru: "Понедельник",
      ua: "Понеділок",    
    },
    scheduleDay2: {
      ru: "Вторник",
      ua: "Вівторок",    
    },
    scheduleDay22: {
      ru: "Вторник",
      ua: "Вівторок",    
    },
    scheduleDay3: {
      ru: "Среда",
      ua: "Середа",    
    },
    scheduleDay33: {
      ru: "Среда",
      ua: "Середа",    
    },
    scheduleDay4: {
      ru: "Четверг",
      ua: "Четвер",    
    },
    scheduleDay44: {
      ru: "Четверг",
      ua: "Четвер",    
    },
    scheduleDay5: {
      ru: "Пятница",
      ua: "П'ятниця",    
    },
    scheduleDay55: {
      ru: "Пятница",
      ua: "П'ятниця",    
    },
    scheduleDay6: {
      ru: "Суббота",
      ua: "Субота",    
    },
    scheduleDay66: {
      ru: "Суббота",
      ua: "Субота",    
    },
    scheduleDay7: {
      ru: "Воскресенье",
      ua: "Неділя",    
    },
    scheduleDay77: {
      ru: "Воскресенье",
      ua: "Неділя",    
    },
    scheduleWekend1: {
      ru: "Выходной",
      ua: "Вихідний",    
    },
    scheduleWekend2: {
      ru: "Выходной",
      ua: "Вихідний",    
    },
    contactsTitle: {
      ru: "Контакты",
      ua: "Контакти",    
    },
    contactsText1: {
      ru: "Остались вопросы?",
      ua: "Залишились питання?",    
    },
    contactsText2: {
      ru: "Мы обязательно позвоним Вам в течение двух дней",
      ua: "Ми обов'язково зателефонуємо Вам протягом двох днів",    
    },
    contactsPlaceholder1: {
      ru: "Ваше имя",
      ua: "Ваше ім'я",    
    },
    contactsPlaceholder2: {
      ru: "Ваш телефон",
      ua: "Ваш телефон",    
    },
    contactsPlaceholder3: {
      ru: "Что Вас интересует",
      ua: "Що Вас цікавить?",    
    },
    contactsButton: {
      ru: "Отправить",
      ua: "Відправити",    
    },
    contactsAddress1: {
      ru: "Киев, ул. Коперника, 17",
      ua: "Київ, вул. Коперника, 17",    
    },
    contactsAddress2: {
      ru: "Киев, ул. Раисы Окипной 4Б",
      ua: "Київ, вул. Раїси Окіпної 4Б",    
    },
    contactsNetworks: {
      ru: "Социальные сети",
      ua: "Соціальні мережі",    
    },
    footerText: {
      ru: "Все права защищены",
      ua: "Всі права захищені",    
    },
    modalPlaceholder1: {
      ru: "Ваше имя",
      ua: "Ваше ім'я",     
    },
    modalPlaceholder2: {
      ru: "Ваш телефон",
      ua: "Ваш телефон",    
    },
    modalPlaceholder3: {
      ru: "Что Вас интересует?",
      ua: "Що Вас цікавить?"   
    },
    dropMenuLink1: {
      ru: "ВНО",
      ua: "ЗНО"   
    },
    dropMenuLink2: {
      ru: "Тренировочные тесты",
      ua: "Тренувальні тести"   
    },
    dropMenuLink3: {
      ru: "Расчет балла ВНО",
      ua: "Розрахунок бала ЗНО"   
    },
}

  const burger = document.querySelector(".header__burger");
  const navBar = document.querySelector(".nav-bar");
  const headerMenue = document.querySelectorAll(".header__link");
  const dropdownBtn = document.querySelector(".dropdown-btn");
  const dropdownList = document.querySelector(".dropdown__list");
  // const dropdownInput = document.querySelector(".dropdown_input");
  
  const allLang = ["ua", "ru"];
  // location.href = window.location.pathname + "#en";
  
  dropdownBtn.addEventListener("click", (event) => {
    event.stopPropagation();
    dropdownList.classList.toggle("show");
  });
  
  const changeURLLanguage = (e) => {
    e.stopPropagation();
    let lang = e.target.dataset.value;
    location.href = window.location.pathname + "#" + lang;
    dropdownList.classList.toggle("show");
    changeLanguage();
  };
  
  dropdownList.addEventListener("click", changeURLLanguage);
  document.addEventListener("click", (event) => {
    if (dropdownList.classList.contains("show")) {
      dropdownList.classList.remove("show");
    }
  });
  document.addEventListener("keydown", (event) => {
    if (event.key === "Tab" || event.key === "Escape") {
      dropdownList.classList.remove("show");
    }
  });
  

  function changeLanguage() {
    let hash = window.location.hash;
    hash = hash.substr(1);
    if (!allLang.includes(hash)) {
      location.href = window.location.pathname + "#ua";
      location.reload();
    }
  
    dropdownBtn.textContent = hash.toUpperCase();
    for (let key in langArr) {
      let element = document.querySelector(".lng-" + key);
      if (element && langArr[key][hash]) {
        if (element.nodeName !== 'TEXTAREA') {
          element.textContent = langArr[key][hash];
        }
        element.setAttribute('placeholder', langArr[key][hash]);
      }
    }
  }
  changeLanguage();